ktand/Arduino_Core_STM32/boards.txt
Maple.build.core=arduino
Maple.build.board=Maple
Maple.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# MAPLEMINI_F103CB board
# Support: Serial2 (USART2 on PA3, PA2) and Serial3 (USART3 on PB11, PB10)
Maple.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
Maple.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
Maple.menu.pnum.MAPLEMINI_F103CB.build.mcu=cortex-m3
Maple.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.build.series=STM32F1xx
Maple.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
Maple.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB
Maple.menu.pnum.MAPLEMINI_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math

# Upload menu
Maple.menu.upload_method.STLinkMethod=STLink
Maple.menu.upload_method.STLinkMethod.upload.protocol=STLink
Maple.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

Maple.menu.upload_method.serialMethod=Serial
Maple.menu.upload_method.serialMethod.upload.protocol=maple_serial
Maple.menu.upload_method.serialMethod.upload.tool=serial_upload

################################################################################
# Armed boards

Armed.name=Armed Series

Armed.build.vid=0x0483
Armed.build.pid=0x5740
Armed.vid.0=0x0483
Armed.pid.0=0x5740

Armed.build.core=arduino
Armed.build.board=Armed
Armed.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# Armed board
# Support: USB CDC
Armed.menu.pnum.Armed_V1=Armed V1 board
Armed.menu.pnum.Armed_V1.upload.maximum_size=1048576
Armed.menu.pnum.Armed_V1.upload.maximum_data_size=196608
Armed.menu.pnum.Armed_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Armed.menu.pnum.Armed_V1.build.board=Armed_V1
Armed.menu.pnum.Armed_V1.build.series=STM32F4xx
Armed.menu.pnum.Armed_V1.build.product_line=STM32F407xx
Armed.menu.pnum.Armed_V1.build.variant=Armed_V1
Armed.menu.pnum.Armed_V1.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
Armed.menu.upload_method.STLink=STLink
Armed.menu.upload_method.STLink.upload.protocol=STLink
Armed.menu.upload_method.STLink.upload.tool=stlink_upload

################################################################################
# Serialx activation
Nucleo_144.menu.xserial.generic=Enabled with generic Serial
Nucleo_144.menu.xserial.none=Enabled without generic Serial
Nucleo_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_144.menu.xserial.disabled=Disabled (No Serial)
Nucleo_144.menu.xserial.disabled.build.xSerial=

Nucleo_64.menu.xserial.generic=Enabled with generic Serial
Nucleo_64.menu.xserial.none=Enabled without generic Serial
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Nucleo_32.menu.xserial.generic=Enabled with generic Serial
Nucleo_32.menu.xserial.none=Enabled without generic Serial
Nucleo_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_32.menu.xserial.disabled=Disabled (No Serial)
Nucleo_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled with generic Serial
Disco.menu.xserial.none=Enabled without generic Serial
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (No Serial)
Disco.menu.xserial.disabled.build.xSerial=

GenF103.menu.xserial.generic=Enabled with generic Serial
GenF103.menu.xserial.none=Enabled without generic Serial
GenF103.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF103.menu.xserial.disabled=Disabled (No Serial)
GenF103.menu.xserial.disabled.build.xSerial=

Maple.menu.xserial.generic=Enabled with generic Serial
Maple.menu.xserial.none=Enabled without generic Serial
Maple.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Maple.menu.xserial.disabled=Disabled (No Serial)
Maple.menu.xserial.disabled.build.xSerial=

Armed.menu.xserial.generic=Enabled with generic Serial
Armed.menu.xserial.none=Enabled without generic Serial
Armed.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Armed.menu.xserial.disabled=Disabled (No Serial)
Armed.menu.xserial.disabled.build.xSerial=

# USB connectivity
Nucleo_144.menu.USB_interface.enable_usb=None
Nucleo_144.menu.USB_interface.enable_usb_periph=Enable USB (if available)
Nucleo_144.menu.USB_interface.enable_usb_periph.build.enable_usb={build.usb_flags}

Nucleo_64.menu.USB_interface.enable_USB=None
Nucleo_64.menu.USB_interface.enable_usb_periph=Enable USB (if available)
Nucleo_64.menu.USB_interface.enable_usb_periph.build.enable_usb={build.usb_flags}

Nucleo_32.menu.USB_interface.enable_USB=None
Nucleo_32.menu.USB_interface.enable_usb_periph=Enable USB (if available)
Nucleo_32.menu.USB_interface.enable_usb_periph.build.enable_usb={build.usb_flags}

Disco.menu.USB_interface.enable_USB=None
Disco.menu.USB_interface.enable_usb_periph=Enable USB (if available)
Disco.menu.USB_interface.enable_usb_periph.build.enable_usb={build.usb_flags}

Armed.menu.USB_interface.enable_USB=None
Armed.menu.USB_interface.enable_usb_periph=Enable USB (if available)
Armed.menu.USB_interface.enable_usb_periph.build.enable_usb={build.usb_flags}

# Optimizations
Nucleo_144.menu.opt.osstd=Smallest (-Os default)
Nucleo_144.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_144.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_144.menu.opt.oslto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o1std=Fast (-O1)
Nucleo_144.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_144.menu.opt.o1std.build.flags.ldspecs=
Nucleo_144.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_144.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_144.menu.opt.o1lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o2std=Faster (-O2)
Nucleo_144.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_144.menu.opt.o2std.build.flags.ldspecs=
Nucleo_144.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_144.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_144.menu.opt.o2lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.o3std=Fastest (-O3)
Nucleo_144.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_144.menu.opt.o3std.build.flags.ldspecs=
Nucleo_144.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_144.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_144.menu.opt.o3lto.build.flags.ldspecs=-flto
Nucleo_144.menu.opt.ogstd=Debug (-g)
Nucleo_144.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_144.menu.opt.ogstd.build.flags.ldspecs=

